a = input("Собака короткошерстной породы? ").lower()
if a == "да":
    b = input("Рост собаки менее 50 см?" ).lower()
    if b == "да":
        c = input("У собаки короткий хвост?" ) .lower()
        if c == "да":
            print("английский бульдог")
        else:
            d = input("У собаки длинные уши?" ).lower()
            if d == "да":
                print("гончая")
            else:
                e = input("У собаки короткое тело?" ).lower()
                if e == "да":
                    print("мопс")
                else:
                    print("чихуахуа")
    else:
        f = input("Собака весит более 50 кг?" ).lower()
        if f == "да":
            print("датский дог")
        else:
            print("фоксхаунд")
else:
    g = input("Рост собаки менее 50 см?" ).lower()
    if g == "да":
        h = input("У собаки доброжелательный характер?" ).lower()
        if h == "да":
            print("кокер-спаниель")
        else:
            print("ирландский сеттер")
    else:
        i = input("У собаки рост менее 70 см?" ).lower()
        if i == "да":
            j = input("У собаки длинные уши?" ).lower()
            if j == "да":
                print("большой вандейский грифон")
            else:
                print("колли")
        else:
            k = input("Окрас рыжий с белыми отметинами?" ).lower()
            if k == "да":
                print("сенбернар")
            else:
                l = input("Белоснежный окрас?").lower()
                if l == "да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")